app/controllers/homes_controller.rb

SELECT  "oauth2_tokens".* FROM "oauth2_tokens" WHERE "oauth2_tokens"."access_token" = $1 ORDER BY "oauth2_tokens"."id" ASC LIMIT $2  [["access_token", "ya29.GlwWBlWxF0UZ0N3hFu863xFir9ubIlaU1c-tBPxIFe8nsIxeXzhRZRo-KyhaeFvd8rANZ-1lAxUA8xXuM-wwJyAvgdqMp8xIna3QPZ1kDiNSqYk4F2aJ2fctJCrdEQ"], ["LIMIT", 1]]
SELECT  "oauth2_tokens".* FROM "oauth2_tokens" WHERE "oauth2_tokens"."access_token" = $1 ORDER BY "oauth2_tokens"."id" ASC LIMIT $2  [["access_token", "ya29.GlsVBg3VvrHMT_ZhC5sizvnEQ5197w8UkWdmF3xUU19oN0Bop9AzsJlLH1DebVrVgLGu_BLZTHU2szRVJlui7hjy79E0x5lOvSBUi3FLxayIeUZz1d3v3QkcQSt4"], ["LIMIT", 1]]
---
  def index
    @token_adwords = Oauth2Token.where(access_token: session[:token_adwords]["access_token"]).first if session[:token_adwords]
    @token_analytics = Oauth2Token.where(access_token: session[:token_analytics]["access_token"]).first if session[:token_analytics].present?