app/controllers/logins_controller.rb

  def callback_ga
    client = create_analytis__request()
    client.code = params['code']
    session[:token_analytics] = client.fetch_access_token!
    if session[:token_analytics]
      flash.notice = 'Authorized successfully'
      oauth2_ga = Oauth2Token.new(access_token: session[:token_analytics]['access_token'], token_type: "analytics", refresh_token: session[:token_analytics]['refresh_token'], expiry: session[:token_analytics]['expires_in'], issued_at: session[:token_analytics]['issued_at'])
      return redirect_to root_path if oauth2_ga.save
---
INSERT INTO "oauth2_tokens" ("token_type", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["token_type", "adwords"], ["created_at", "2018-09-12 10:29:10.310318"], ["updated_at", "2018-09-12 10:29:10.310318"]]

  def callback()
    api = get_adwords_api()
    begin
      session[:token_adwords] = api.authorize(
          {
            :oauth2_callback => "#{ENV['DOMAIN']}#{login_callback_path}",
            :oauth2_verification_code => params[:code]
          }
      )
      flash.notice = 'Authorized successfully'
      oauth2_ga = Oauth2Token.new(access_token: session[:token_adwords][:access_token], token_type: "adwords", refresh_token: session[:token_adwords][:refresh_token], expiry: session[:token_adwords][:expires_in], issued_at: session[:token_adwords][:issued_at])
      return redirect_to root_path if oauth2_ga.save
---
INSERT INTO "oauth2_tokens" ("token_type", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["token_type", "adwords"], ["created_at", "2018-09-12 10:32:21.282717"], ["updated_at", "2018-09-12 10:32:21.282717"]]